OpenFOAM/ESIOF/tutorials/nozzle/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 70636.93133;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 9720000;
    }
    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.3;
        fieldInf        70636.93133;
        lInf            1;
        value           uniform 70636.93133;
    }
    wall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
    	type 		empty;
    }
}

// ************************************************************************* //
